class Speciality:
    names = (
        "Сертификаты и подписки",
        "ОРТОПЕДИЧЕСКАЯ СТОМАТОЛОГИЯ",
        "Терапевтическая стоматологоия",
        "Электронные родовые сертификаты",
        "ИМПЛАНТАЦИЯ",
        "ПО СОГЛАСОВАНИЮ",
        "ХИРУРГИЧЕСКАЯ СТОМАТОЛОГИЯ",
        "ТЕРАПЕВТИЧЕСКАЯ СТОМАТОЛОГИЯ VECTOR",
        "ТЕРАПЕВТИЧЕСКАЯ СТОМАТОЛОГИЯ",
        "ОРТОПЕДИЧЕСКАЯ СТОМАТОЛОГИЯ ВРАЧ ПОВЫШЕННОЙ КАТЕГОРИИ",
        "Слепки",
        "Хирургия",
        "Вкладки",
        "ДЕТСКАЯ СТОМАТОЛОГИЯ",
        "ОРТОПЕДИЧЕСКАЯ СТОМАТОЛОГИЯ ГЛ.ВРАЧ",
        "ОРТОПЕДИЧЕСКАЯ СТОМАТОЛОГИЯ ВРАЧ",
        "Консультации врача",
        "ПРОФЕССИОНАЛЬНАЯ ГИГИЕНА",
        "Продукция",
        "Исправление прикуса",
        "Дополнительно",
        "Виниры",
        "ОБЩИЕ",
        "Консультации главного врача",
        "Абатменты",
        "Коронки",
        "ОРТОДОНТИЯ (исправление прикуса)"
    )

    def __init__(self, name: str):
        name = str(name).replace("  ", " ").replace("\t", "")

        if name not in self.names:
            raise NameError(f"{name} not in {self.names}")

        self.name = name